
&НаКлиенте
Процедура ПереченьТоваровКоличествоПриИзменении(Элемент)
	// Получаем строку, в которой в данный момент работает пользователь
	СтрТабЧасти=Элементы.ПереченьТоваров.ТекущиеДанные;
	//Сумма=Цена*Количество
	СтрТабЧасти.Сумма=СтрТабЧасти.Цена*СтрТабЧасти.Количество;
КонецПроцедуры

&НаКлиенте
Процедура ПереченьТоваровЦенаПриИзменении(Элемент)
	// Получаем строку, в которой в данный момент работает пользователь
	СтрТабЧасти=Элементы.ПереченьТоваров.ТекущиеДанные;
	//Сумма=Цена*Количество
	СтрТабЧасти.Сумма=СтрТабЧасти.Цена*СтрТабЧасти.Количество;
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Сообщить("Общая сумма по документу "+ ТекущийОбъект.ПереченьТоваров.Итог("Сумма")+" руб.");
КонецПроцедуры

&НаКлиенте
Процедура ПереченьТоваровТоварПриИзменении(Элемент)
	// Получаем строку, в которой в данный момент работает пользователь
	СтрТабЧасти=Элементы.ПереченьТоваров.ТекущиеДанные;
	// Цена поступления будет получена из общего модуля и общей функции "Цена на день"
	СтрТабЧасти.ЦенаПоступления=ОбщиеФункции.ЦенаНаДень(Объект.Дата, СтрТабЧасти.Товар);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦенуПоступления(Команда)
Для каждого СтрТабЧасти Из Объект.ПереченьТоваров Цикл
		СтрТабЧасти.ЦенаПоступления=ОбщиеФункции.ЦенаНаДень(Объект.Дата, СтрТабЧасти.Товар);
КонецЦикла;
КонецПроцедуры
