
&НаКлиенте
Процедура ПереченьТоваровКоличествоПриИзменении(Элемент)
	// актуализация строки табличной части
	СтрТабЧасти=Элементы.ПереченьТоваров.ТекущиеДанные;
	//Сумма=Цена*Кол-во
	СтрТабЧасти.Сумма=СтрТабЧасти.Цена*СтрТабЧасти.Количество;	
КонецПроцедуры

&НаКлиенте
Процедура ПереченьТоваровЦенаПриИзменении(Элемент)
	// актуализация строки табличной части
	СтрТабЧасти=Элементы.ПереченьТоваров.ТекущиеДанные;
	//Сумма=Цена*Кол-во
	СтрТабЧасти.Сумма=СтрТабЧасти.Цена*СтрТабЧасти.Количество;	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект=Объект.ПереченьТоваров;
	Сообщить("Всего в документе " +ТекущийОбъект.Количество()+ " строк(и) с количеством товаров "+ТекущийОбъект.Итог("Количество")+ "шт");
КонецПроцедуры
