
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр КоличествоТоваров Расход
	Движения.КоличествоТоваров.Записывать = Истина;
	//1. переменная для табличной части
	ТЗ = ПереченьТоваров.Выгрузить();
	//2. переменная для запроса
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	ТЗ.Товар КАК Товар,
	              |	ТЗ.Количество КАК Количество
	              |ПОМЕСТИТЬ ВТ_ТоварыДокумента
	              |ИЗ
	              |	&ТЗ КАК ТЗ
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	ВТ_ТоварыДокумента.Товар КАК Товар,
	              |	ВТ_ТоварыДокумента.Количество КАК Количество,
	              |	ЕСТЬNULL(КоличествоТоваровОстатки.КоличествоОстаток, 0) КАК Остаток,
	              |	ВЫБОР
	              |		КОГДА ЕСТЬNULL(КоличествоТоваровОстатки.КоличествоОстаток, 0) < ВТ_ТоварыДокумента.Количество
	              |			ТОГДА ЛОЖЬ
	              |		ИНАЧЕ ИСТИНА
	              |	КОНЕЦ КАК Проверка
	              |ИЗ
	              |	ВТ_ТоварыДокумента КАК ВТ_ТоварыДокумента
	              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.КоличествоТоваров.Остатки(&Период, Филиал = &Филиал) КАК КоличествоТоваровОстатки
	              |		ПО ВТ_ТоварыДокумента.Товар = КоличествоТоваровОстатки.Товар";
	//3. параметры
Запрос.УстановитьПараметр("ТЗ",ТЗ);
Запрос.УстановитьПараметр("Период", Дата);
Запрос.УстановитьПараметр("Филиал", Филиал);
//4. получание результата
Результат=Запрос.Выполнить();
Выборка=Результат.Выгрузить();
//ПереченьТоваров.Загрузить(Выборка);
//5. формирование таблицы проверки
ТаблицаДляПроверки = Выборка.Скопировать();
ТаблицаДляПроверки.Свернуть("Проверка");
//6. проверка
  ЕстьНехватки= Ложь;
  Если ТаблицаДляПроверки.Количество() = 1 Тогда //или все "Ложь" или все "Истина"
	  Если ТаблицаДляПроверки[0].Проверка = Истина Тогда
		  ЕстьНехватки = Ложь; //товаров хватает
	  Иначе
		  ЕстьНехватки = Истина; //товаров не хватает
	  КонецЕсли;
  Иначе
	  ЕстьНехватки = Истина; //одной или нескольких позиций товаров не хватает
	  КонецЕсли;
   //7.Движения или сообщения
   Если Не ЕстьНехватки Тогда
	   //Движения - товаров хватает
	   Для Каждого Стр Из Выборка Цикл
		Движение = Движения.КоличествоТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Количество = Стр.Количество;
		Движение.Товар = Стр.Товар;
		Движение.Филиал = Филиал;
	КонецЦикла;
Иначе
	//сообщение - если товара не хватает
	Отказ = Истина;
	Для каждого Стр Из Выборка Цикл
		Если Не Стр.Проверка Тогда
			Сообщить("Товара " + Стр.Товар+" не хватает в количестве " + (Стр.Количество-Стр.Остаток));
		КонецЕсли;
	КонецЦикла;
	  КонецЕсли;	
	
	// регистр ПродажиПоФилиалам 
	Движения.ПродажиПоФилиалам.Записывать = Истина;
	Для Каждого ТекСтрокаПереченьТоваров Из ПереченьТоваров Цикл
		Движение = Движения.ПродажиПоФилиалам.Добавить();
		Движение.Период = Дата;
		Движение.Филиал = Филиал;
		Движение.Менеджер = Менеджер;
		Движение.Сумма = ТекСтрокаПереченьТоваров.Сумма;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказыКлиентов") Тогда
		// Заполнение шапки
		Менеджер = ДанныеЗаполнения.Менеджер;
		Филиал = ДанныеЗаполнения.Филиал;
		Фирма = ДанныеЗаполнения.Фирма;
		Для Каждого ТекСтрокаПереченьТоваров Из ДанныеЗаполнения.ПереченьТоваров Цикл
			НоваяСтрока = ПереченьТоваров.Добавить();
			НоваяСтрока.Количество = ТекСтрокаПереченьТоваров.Количество;
			НоваяСтрока.Товар = ТекСтрокаПереченьТоваров.Товар;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
