
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ИмяФайла="";
	ПоместитьФайл(ИмяФайла,,ПутьКФайлу, Истина);
КонецПроцедуры

&НаСервере
Процедура ПрочитатьФайлНаСервере()
    ТекстовыйДокумент = Новый ТекстовыйДокумент;
    ТекстовыйДокумент.Прочитать(ПутьКфайлу);
    ВсегоСтрок = ТекстовыйДокумент.КоличествоСтрок();
	Счетчик=2; 
    ТЗ = Новый ТаблицаЗначений; 
    ТЗ.Колонки.Добавить("Код");
    ТЗ.Колонки.Добавить("Товар");
    ТЗ.Колонки.Добавить("Описание");
    ТЗ.Колонки.Добавить("Категория");
    ТЗ.Колонки.Добавить("Поставщик");
    ТЗ.Колонки.Добавить("Город");
	Пока Счетчик<=ВсегоСтрок Цикл 
	    Строка = ТекстовыйДокумент.ПолучитьСтроку(Счетчик);
        Массив = СтрРазделить(Строка,";");
        НоваяСтрокаТЗ=ТЗ.Добавить();
        НоваяСтрокаТЗ.Код=Массив[0];
        НоваяСтрокаТЗ.Товар=Массив[1];
        НоваяСтрокаТЗ.Описание=Массив[2];
        НоваяСтрокаТЗ.Категория=Массив[3];
        НоваяСтрокаТЗ.Поставщик=Массив[4];
        НоваяСтрокаТЗ.Город=Массив[5];
        Счетчик=Счетчик+1;
КонецЦикла;	

НоваяТЗ=ТЗ.Скопировать();
НоваяТЗ.Свернуть("Код, Товар, Описание, Категория, Поставщик, Город");
Для каждого Стр Из НоваяТЗ Цикл
    НайденныйГород=Справочники.Города.НайтиПоНаименованию(Стр.Город);
Если НайденныйГород=Справочники.Города.ПустаяСсылка() Тогда 
	НовыйГород=Справочники.Города.СоздатьЭлемент();
    НовыйГород.Наименование=Стр.Город;
    НовыйГород.Записать();
    НайденныйГород=НовыйГород.Ссылка;
КонецЕсли;
Найденнаяфирма=Справочники.Фирмы.НайтиПоНаименованию(Стр.Поставщик);
Если Найденнаяфирма=Справочники.Фирмы.ПустаяСсылка() Тогда
	Новаяфирма=Справочники.Фирмы.СоздатьЭлемент();
    Новаяфирма.Наименование=Стр.Поставщик;
    Новаяфирма.Город=НайденныйГород;
    Новаяфирма.Записать();
    Найденнаяфирма=Новаяфирма.Ссылка;
КонецЕсли;
НайденныйТовар=Справочники.Товары.НайтиПоНаименованию(Стр.Товар);
Если НайденныйТовар=Справочники.Товары.ПустаяСсылка() Тогда
	Новыйтовар=Справочники.Товары.СоздатьЭлемент();
    НовыйТовар.Код=Стр.Код;
    Новыйтовар.Наименование=Стр.Товар;
    Новыйтовар.Описание=Стр.Описание;
Попытка
    НовыйТовар.Категория=Перечисления.Категории[Стр.Категория];
Исключение
    Сообщить("Катетория " +Стр.Категория+" не найдена");
КонецПопытки;
    НовыйТовар.ОсновнойПоставщик=Найденнаяфирма;
    Новыйтовар.Записать();
    НайденныйТовар=НовыйТовар.Ссылка;
    КонецЕсли;
КонецЦикла;
Сообщить("Импорт в справочник Товары выполнен");
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайл(Команда)
	ПрочитатьФайлНаСервере();
КонецПроцедуры
