
&НаСервере
Процедура РезультатНаСервере()
	ТЗ=ПереченьТоваров.Выгрузить();
	Запрос=Новый Запрос;
	Запрос.Текст= "ВЫБРАТЬ
	              |	ТЗ.Товар КАК Товар,
	              |	ТЗ.Количество КАК Количество
	              |ПОМЕСТИТЬ ВТ_ТоварыДокумента
	              |ИЗ
	              |	&ТЗ КАК ТЗ
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	ВТ_ТоварыДокумента.Товар КАК Товар,
	              |	ВТ_ТоварыДокумента.Количество КАК Количество,
	              |	ЕСТЬNULL(КоличествоТоваровОстатки.КоличествоОстаток, 0) КАК Остаток,
	              |	ВЫБОР
	              |		КОГДА ЕСТЬNULL(КоличествоТоваровОстатки.КоличествоОстаток, 0) < ВТ_ТоварыДокумента.Количество
	              |			ТОГДА ЛОЖЬ
	              |		ИНАЧЕ ИСТИНА
	              |	КОНЕЦ КАК Проверка
	              |ИЗ
	              |	ВТ_ТоварыДокумента КАК ВТ_ТоварыДокумента
	              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.КоличествоТоваров.Остатки(&Период, Филиал = &Филиал) КАК КоличествоТоваровОстатки
	              |		ПО ВТ_ТоварыДокумента.Товар = КоличествоТоваровОстатки.Товар";
	Запрос.УстановитьПараметр("ТЗ", ТЗ);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Филиал", Филиал);
	Результат=Запрос.Выполнить();
	Выборка=Результат.Выгрузить();
	ПереченьТоваров.Загрузить(Выборка);
КонецПроцедуры

&НаКлиенте
Процедура Результат(Команда)
	РезультатНаСервере();
КонецПроцедуры
