Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//Первый вариант
	СуммаДокумента = 0;
	
	Для Каждого СтрокаДокумента Из Продукты Цикл
		СуммаДокумента = СуммаДокумента + (СтрокаДокумента.Количество * СтрокаДокумента.Цена);
	КонецЦикла;	
	
	//Второй вариант. Он бы работал, если бы была колонка Сумма
	//СуммаДокумента = Продукты.Итог("Сумма")
	
	//Третий вариант, через запрос. тоже неудачный.
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	СУММА(ПокупкаПродукты.Количество * ПокупкаПродукты.Цена) КАК Сумма
	//               |ИЗ
	//               |	Документ.Покупка.Продукты КАК ПокупкаПродукты
	//               |ГДЕ
	//               |	ПокупкаПродукты.Ссылка = &Ссылка";
	//
	//Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	//	СуммаДокумента = ВыборкаДетальныеЗаписи.Сумма;
	//КонецЕсли;
	                                                  	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
		
	//Проверим, нужно ли проводить документ
	Если Продукты.Количество() = 0 Тогда
		Сообщить("Внимание! Документ не содержит строк! Проведение невозможно.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	//Установим флаг сохранения движений по регистру Продукты и Затраты
	Движения.Продукты.Записывать = Истина;
	Движения.Затраты.Записывать  = Истина;
	
	//Выбираем данные из документа
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПокупкаПродукты.Продукт КАК Продукт,
	               |	СУММА(ПокупкаПродукты.Количество) КАК Количество,
	               |	СУММА(ПокупкаПродукты.Количество * ПокупкаПродукты.Цена) КАК Сумма
	               |ИЗ
	               |	Документ.Покупка.Продукты КАК ПокупкаПродукты
	               |ГДЕ
	               |	ПокупкаПродукты.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПокупкаПродукты.Продукт";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	//Формируем движения/записи регистра
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Движение = Движения.Продукты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период 	 = Дата;
		Движение.Продукт 	 = ВыборкаДетальныеЗаписи.Продукт;
		Движение.Количество  = ВыборкаДетальныеЗаписи.Количество;	
		Движение.Сумма		 = ВыборкаДетальныеЗаписи.Сумма;
	
	КонецЦикла;
	
	//Запишем сумму в затраты
	ДвижениеЗатрат = Движения.Затраты.Добавить();
	ДвижениеЗатрат.Период 	= Дата;
	ДвижениеЗатрат.Магазин 	= Магазин;
	ДвижениеЗатрат.Сумма    = СуммаДокумента;	
	
КонецПроцедуры


