&НаКлиенте
Процедура ОбработкаИзмененияПродукта() 
	
Если ЗначениеЗаполнено(Объект.Продукт) Тогда 	
  Если Вопрос("Табличная часть будет заполнена! Продолжить?",
		РежимДиалогаВопрос.ДаНет)= КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
КонецЕсли;    

    Если Объект.Продукты.Количество() > 0 Тогда
	Если Вопрос("Очистить табличную часть?",
		РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Да Тогда
		Объект.Продукты.Очистить(); 
	КонецЕсли;  
КонецЕсли;  

   Если ЗначениеЗаполнено(Объект.Продукт) Тогда
	ЗаполнитьТабЧастьПродуктыНаСервере();
КонецЕсли;

КонецПроцедуры 

//Обработчики

&НаСервере
Процедура ЗаполнитьТабЧастьПродуктыНаСервере()
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	            	|	ПродуктыИнгредиенты.Продукт КАК Продукт,
	             	|	ПродуктыИнгредиенты.Количество КАК Количество
	            	|ИЗ
	             	|	Справочник.Продукты.Ингредиенты КАК ПродуктыИнгредиенты
	            	|ГДЕ
		            |	ПродуктыИнгредиенты.Ссылка=&Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",Объект.Продукт);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		
	НоваяСтрока = Объект.Продукты.Добавить();	
	НоваяСтрока.Продукт = ВыборкаДетальныеЗаписи.Продукт;	
	НоваяСтрока.Количество = ВыборкаДетальныеЗаписи.Количество*Объект.КоличествоПорций;	
	
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТабЧастьПродукты(Команда)
	
	ОбработкаИзмененияпродукта();	

КонецПроцедуры

&НаКлиенте
Процедура ПродуктПриИзменении(Элемент) 
	
ОбработкаИзмененияПродукта();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТабЧастьПродукты(Команда)  
	
Если Объект.Продукты.Количество() > 0 Тогда
	Если Вопрос("Очистить табличную часть?", РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Да Тогда
		Объект.Продукты.Очистить(); 
	КонецЕсли;  
КонецЕсли;    

КонецПроцедуры
