
&НаСервере
Процедура ПолучитьРезультатНаСервере()
	// 1. Переменная для реализации запроса
	Запрос1=Новый Запрос;
	Запрос1.Текст="ВЫБРАТЬ
	              |	ФирмыКонтактныеЛица.Ссылка КАК Организация,
	              |	ФирмыКонтактныеЛица.Сотрудник КАК Сотрудник,
	              |	ФирмыКонтактныеЛица.Должность КАК Должность,
	              |	ФирмыКонтактныеЛица.Телефон КАК Телефон
	              |ИЗ
	              |	Справочник.Фирмы.КонтактныеЛица КАК ФирмыКонтактныеЛица
	              |ГДЕ
	              |	ФирмыКонтактныеЛица.Сотрудник = &Сотрудник";
	//2.Параметры
	Запрос1.УстановитьПараметр("Сотрудник",Сотрудник);
	//3.Получить результат
	Результат1=Запрос1.Выполнить();
	Выборка1=Результат1.Выгрузить();
	Результат.Загрузить(Выборка1);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьРезультат(Команда)
	ПолучитьРезультатНаСервере();
КонецПроцедуры
