
&НаСервере
Процедура ПолучитьРезультатНаСервере()
	// 
	Запрос1=Новый Запрос;
	Запрос1.Текст="ВЫБРАТЬ
	              |	ФирмыКонтактныеЛица.Ссылка КАК Организация,
	              |	ФирмыКонтактныеЛица.Сотрудник КАК Сотрудник,
	              |	ФирмыКонтактныеЛица.Должность КАК Должность,
	              |	ФирмыКонтактныеЛица.Телефон КАК Телефон
	              |ИЗ
	              |	Справочник.Фирмы.КонтактныеЛица КАК ФирмыКонтактныеЛица
	              |ГДЕ
	              |	ФирмыКонтактныеЛица.Сотрудник = &Сотрудник";
	Запрос1.УстановитьПараметр("Сотрудник", Сотрудник);
	Результат1=Запрос1.Выполнить();
	Выборка=Результат1.Выгрузить();
	Результат.Загрузить(Выборка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьРезультат(Команда)
	ПолучитьРезультатНаСервере();
КонецПроцедуры
