
&НаКлиенте
Процедура ПереченьТоваровКоличествоПриИзменении(Элемент)
	// актуализация строки табличной части
	СтрТабЧасти=Элементы.ПереченьТоваров.ТекущиеДанные;
	//Сумма=Цена*Кол-во
	СтрТабЧасти.Сумма=СтрТабЧасти.Цена*СтрТабЧасти.Количество;	
КонецПроцедуры

&НаКлиенте
Процедура ПереченьТоваровЦенаПриИзменении(Элемент)
	// актуализация строки табличной части
	СтрТабЧасти=Элементы.ПереченьТоваров.ТекущиеДанные;
	//Сумма=Цена*Кол-во
	СтрТабЧасти.Сумма=СтрТабЧасти.Цена*СтрТабЧасти.Количество;	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект=Объект.ПереченьТоваров;
	Сообщить("Общая сумма по документу "+ТекущийОбъект.Итог("Сумма")+ "руб.");
	
КонецПроцедуры

&НаКлиенте
Процедура ПереченьТоваровТоварПриИзменении(Элемент)
	СтрТабЧасти=Элементы.ПереченьТоваров.ТекущиеДанные;
	СтрТабЧасти.ЦенаПоступления=ОбщиеФункции.ЦенаНаДень(Объект.Дата, СтрТабЧасти.Товар);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦенуПоступления(Команда)
	СтрТабЧасти=Элементы.ПереченьТоваров.ТекущиеДанные;
	СтрТабЧасти.ЦенаПоступления=ОбщиеФункции.ЦенаНаДень(Объект.Дата, СтрТабЧасти.Товар);
КонецПроцедуры
