
Процедура ОбработкаПроведения(Отказ, Режим)
	
	//Выставляем флаг записи набора Продукты
	Движения.Продукты.Записывать = Истина;
	
	//Выбираем данные для проведения
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПотреблениеПродукты.Продукт КАК Продукт,
	               |	СУММА(ПотреблениеПродукты.Количество) КАК Количество
	               |ПОМЕСТИТЬ втДанныеДокумента
	               |ИЗ
	               |	Документ.Потребление.Продукты КАК ПотреблениеПродукты
	               |ГДЕ
	               |	ПотреблениеПродукты.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПотреблениеПродукты.Продукт
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втДанныеДокумента.Продукт КАК Продукт,
	               |	втДанныеДокумента.Количество КАК Количество,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ПродуктыОстатки.КоличествоОстаток, 0) >= втДанныеДокумента.Количество
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ДостаточноОстатков,
	               |	ВЫБОР
	               |		КОГДА втДанныеДокумента.Количество = ЕСТЬNULL(ПродуктыОстатки.КоличествоОстаток, 0)
	               |			ТОГДА ЕСТЬNULL(ПродуктыОстатки.СуммаОстаток, 0)
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ЕСТЬNULL(ПродуктыОстатки.КоличествоОстаток, 0) = 0
	               |					ТОГДА 0
	               |				ИНАЧЕ ЕСТЬNULL(ПродуктыОстатки.СуммаОстаток, 0) / ЕСТЬNULL(ПродуктыОстатки.КоличествоОстаток, 0) * втДанныеДокумента.Количество
	               |			КОНЕЦ
	               |	КОНЕЦ КАК Стоимость,
	               |	втДанныеДокумента.Продукт.Представление КАК ПродуктПредставление
	               |ИЗ
	               |	втДанныеДокумента КАК втДанныеДокумента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продукты.Остатки(
	               |				&МоментВремени,
	               |				Продукт В
	               |					(ВЫБРАТЬ
	               |						втДанныеДокумента.Продукт КАК Продукт
	               |					ИЗ
	               |						втДанныеДокумента КАК втДанныеДокумента)) КАК ПродуктыОстатки
	               |		ПО втДанныеДокумента.Продукт = ПродуктыОстатки.Продукт";
	
	Запрос.УстановитьПараметр("МоментВремени",  МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", 		Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	//Проверяем можно ли провести документ
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл				
		Если НЕ ВыборкаДетальныеЗаписи.ДостаточноОстатков Тогда
			Сообщить("Внимание! Недостаточно продукта: " + ВыборкаДетальныеЗаписи.ПродуктПредставление);
			Отказ = Истина;
		КонецЕсли;			
	КонецЦикла;
	
	//Если всё хорошо, то документ проводим
	Если НЕ Отказ Тогда
		
		//Формируем движения по регистру Продукты
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл		
			
			Движение = Движения.Продукты.Добавить();
			Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
			Движение.Период 		= Дата;
			Движение.Продукт		= ВыборкаДетальныеЗаписи.Продукт;
			Движение.Количество 	= ВыборкаДетальныеЗаписи.Количество;
			Движение.Сумма 			= ВыборкаДетальныеЗаписи.Стоимость;	
				
		КонецЦикла;
			
	КонецЕсли;
			
КонецПроцедуры
