
&НаКлиенте
Процедура ПереченьТоваровКоличествоПриИзменении(Элемент)
	//Получаем строку, в которой в данный момент работает пользователь
	СтрТабЧасти=Элементы.ПереченьТоваров.ТекущиеДанные;
	//Сумма=Цена*Количество
	СтрТабЧасти.Сумма=СтрТабЧасти.Цена*СтрТабЧасти.Количество;
КонецПроцедуры

&НаКлиенте
Процедура ПереченьТоваровЦенаПриИзменении(Элемент)
	//Получаем строку, в которой в данный момент работает пользователь
	СтрТабЧасти=Элементы.ПереченьТоваров.ТекущиеДанные;
	//Сумма=Цена*Количество
	СтрТабЧасти.Сумма=СтрТабЧасти.Цена*СтрТабЧасти.Количество;
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Сообщить("Общая сумма по документу "+
	ТекущийОбъект.ПереченьТоваров.Итог("Сумма")+" руб.");
КонецПроцедуры

&НаКлиенте
Процедура ПереченьТоваровТоварПриИзменении(Элемент)
 СтрокаТаблицы = Элементы.ПереченьТоваров.ТекущиеДанные;
 СтрокаТаблицы.ЦенаПоступления = ОбщиеФункции.ЦенаНаДень(Объект.Дата, СтрокаТаблицы.Товар);
КонецПроцедуры
